lains/stm32-linky-display/src/main.cpp
    unsigned int lcdRefreshCount = 0;
#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
    TimeOfDay fakeHorodate(23, 30, 0); // 23h30m00s
#endif

    TicEvaluatedPower lastReceivedPower;

    uint32_t debugContext = 0;
    while (1) {
        lcd.waitForFinalDisplayed(streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* Wait until the LCD displays the final framebuffer */
        //debugTerm.send("Display refresh\r\n");

        Stm32MeasurementTimer fullDisplayCycleTimeMs(true);

        uint16_t currentPencilYPos = 0;

#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
        {
            int fakePowerRefV = static_cast<int>(3000) - (static_cast<int>((lcdRefreshCount*30) % 6000)); /* Results in sweeping from +3000 to -3000W */
            int fakeMinPower = fakePowerRefV;
            int fakeMaxPower = fakePowerRefV;
            if (fakePowerRefV < 0) { /* When reaching negative values, forge a range instead of an exact measurement to be more realistic */
                fakeMinPower = fakePowerRefV/3;
                fakeMaxPower = fakePowerRefV/4; /* If negative, corrects to -3000 to [-1000;-750] */
            }
            TicEvaluatedPower fakePower(fakeMinPower, fakeMaxPower);
            char sampleHorodateAsCString[] = "e230502233000";
            TIC::Horodate fakeTICFrameHorodate = TIC::Horodate::fromLabelBytes(reinterpret_cast<uint8_t*>(sampleHorodateAsCString), strlen(sampleHorodateAsCString));
            fakeTICFrameHorodate.hour = fakeHorodate.hour;
            fakeTICFrameHorodate.minute = fakeHorodate.minute;
            fakeTICFrameHorodate.second = fakeHorodate.second;
            fakeHorodate.addSeconds(30); /* Fast forward in time */
            ticParser.lastFrameMeasurements.instPower = fakePower;
            powerHistory.onNewPowerData(fakePower, fakeHorodate, ticContext.lastParsedFrameNb);
        }
        ticParser.nbFramesParsed++; /* Introspection for debug */
        ticContext.lastParsedFrameNb = ticParser.nbFramesParsed;
#endif
        /* We can now work on draft buffer */
        uint8_t pos = 0;
        char statusLine[]="@@@@@L @@@@@F @@@@@@@@B @@X H@@:@@:@@ T@@:@@:@@";
        statusLine[pos++]=(lcdRefreshCount / 10000) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 1000) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 100) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 10) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 1) % 10 + '0';
        pos++; // 'L'

        pos++;

        unsigned int framesCount = ticParser.nbFramesParsed;
        statusLine[pos++]=(framesCount / 10000) % 10 + '0';
        statusLine[pos++]=(framesCount / 1000) % 10 + '0';
        statusLine[pos++]=(framesCount / 100) % 10 + '0';
        statusLine[pos++]=(framesCount / 10) % 10 + '0';
        statusLine[pos++]=(framesCount / 1) % 10 + '0';
        pos++; // 'F'

        pos++;

        unsigned long rxBytesCount = ticSerial.getRxBytesTotal();
        statusLine[pos++]=(rxBytesCount / 10000000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1000000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 100000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 10000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 100) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 10) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1) % 10 + '0';
        pos++; // 'B'

        pos++;

        unsigned int serialRxOverflowCount = ticContext.serialRxOverflowCount;
        statusLine[pos++]=(serialRxOverflowCount / 10) % 10 + '0';
        statusLine[pos++]=(serialRxOverflowCount / 1) % 10 + '0';
        pos++; // 'X'

        pos++;

        pos++; // 'H' like time from Horodate
        unsigned int nbSamples = 1;
        PowerHistoryEntry lastMeasurement;
        powerHistory.getLastPower(nbSamples, &lastMeasurement);
        if (nbSamples == 1 && lastMeasurement.timestamp.isValid) {   /* We have a valid last measurement */
            const TimeOfDay& displayedHorodate = lastMeasurement.timestamp;
            unsigned int horodateHour = displayedHorodate.hour;
            statusLine[pos++]=(horodateHour / 10) % 10 + '0';
            statusLine[pos++]=(horodateHour / 1) % 10 + '0';
            pos++;
            unsigned int horodateMinute = displayedHorodate.minute;
            statusLine[pos++]=(horodateMinute / 10) % 10 + '0';
            statusLine[pos++]=(horodateMinute / 1) % 10 + '0';
            pos++;
            unsigned int horodateSecond = displayedHorodate.second;
            statusLine[pos++]=(horodateSecond / 10) % 10 + '0';
            statusLine[pos++]=(horodateSecond / 1) % 10 + '0';
        }
        else {
            pos += 8;
        }

        statusLine[pos] = '\0'; /* Temporarily terminate string, wiping the Txx:xx:xx text */
        BSP_LCD_SetFont(&Font24);
        auto get_font24_ptr = [](const char c) {
            unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
            return &(Font24.table[(c-' ') * bytesPerGlyph]);
        };
        //lcd.fillRect(0, 0, lcd.getWidth(), Font24.Height, Stm32LcdDriver::LCD_Color::Black);
        
        currentPencilYPos += 24; /* Move a bit away from the very top of the screen. A few LCD display actually hide the very first pixels */
        lcd.drawText(0, currentPencilYPos, statusLine, Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::White, Stm32LcdDriver::LCD_Color::Black);

        statusLine[pos++] = ' ';
        {
            Stm32LcdDriver::LCD_Color textColor = Stm32LcdDriver::LCD_Color::Green;
            if (ticContext.currentTime.relativeToBoot) {
                textColor = Stm32LcdDriver::LCD_Color::Red;
            }
            char* statusLineSystemTime = &(statusLine[pos]);
            pos++; // 'T' like system time (or uptime)
            unsigned int systemTimeHour = ticContext.currentTime.time.hour;
            statusLine[pos++]=(systemTimeHour / 10) % 10 + '0';
            statusLine[pos++]=(systemTimeHour / 1) % 10 + '0';
            pos++;
            unsigned int systemTimeMinute = ticContext.currentTime.time.minute;
            statusLine[pos++]=(systemTimeMinute / 10) % 10 + '0';
            statusLine[pos++]=(systemTimeMinute / 1) % 10 + '0';
            pos++;
            unsigned int systemTimeSecond = ticContext.currentTime.time.second;
            statusLine[pos++]=(systemTimeSecond / 10) % 10 + '0';
            statusLine[pos++]=(systemTimeSecond / 1) % 10 + '0';
            pos++;
            
            /* Draw only the system time part of statusLine (the trailing characters) */
            lcd.drawText((statusLineSystemTime - statusLine)*17, currentPencilYPos, statusLineSystemTime, Font24.Width, Font24.Height, get_font24_ptr, textColor, Stm32LcdDriver::LCD_Color::Black);
        }
        currentPencilYPos += Font24.Height;

        lcd.fillRect(0, currentPencilYPos, lcd.getWidth(), lcd.getHeight() - currentPencilYPos, Stm32LcdDriver::LCD_Color::White);
        ticContext.lastDisplayedPowerFrameNb = ticContext.lastParsedFrameNb; /* Used to detect a new TIC frame and display it as soon as it appears */

        if (ticContext.instantaneousPower.isValid) {
            lastReceivedPower = ticContext.instantaneousPower;
        }
        if (lastReceivedPower.isValid) {   /* We have a valid last measurement */
            char mainInstPowerText[] = "-[9999;9999]W";
            const TicEvaluatedPower& instantaneousPower = lastReceivedPower;
            if (instantaneousPower.isExact && instantaneousPower.minValue>0) {  /* We are withdrawing power */
                unsigned int withdrawnPower = static_cast<unsigned int>(instantaneousPower.minValue);
                if (withdrawnPower <= 9999) {
                    for (unsigned int pos=0; pos<8; pos++)
                        mainInstPowerText[pos] = ' ';   /* Fill leading characters with blank */
                    
                    if (withdrawnPower < 1000) {
                        mainInstPowerText[8]=' ';
                    } else {
                        uint8_t digit1000 = (withdrawnPower / 1000) % 10;
                        mainInstPowerText[8]=digit1000 + '0';
                    }
                    if (withdrawnPower < 100) {
                        mainInstPowerText[9]=' ';
                    } else {
                        uint8_t digit100 = (withdrawnPower / 100) % 10;
                        mainInstPowerText[9]=digit100 + '0';
                    }
                    if (withdrawnPower < 10) {
                        mainInstPowerText[10]=' ';
                    } else {
                        uint8_t digit10 = (withdrawnPower / 10) % 10;
                        mainInstPowerText[10]=digit10  + '0';
                    }
                    {
                        uint8_t digit1 = (withdrawnPower / 1) % 10;
                        mainInstPowerText[11]=digit1 + '0';
                    }
                    mainInstPowerText[12]='W';
                }
                else {
                    for (unsigned int pos=0; pos<sizeof(mainInstPowerText)-1; pos++)
                        mainInstPowerText[pos] = '?';   /* Fill all characters with blank */
                }
            }
            else { /* We are injecting power */
                if (instantaneousPower.isValid) {
                    unsigned int minPower = -(instantaneousPower.minValue); /* min and max will be negative */
                    unsigned int maxPower = -(instantaneousPower.maxValue);
                    mainInstPowerText[0]='-';
                    mainInstPowerText[1]='[';
                    if (minPower < 1000) {
                        mainInstPowerText[2]=' ';
                    } else {
                        uint8_t digit1000 = (minPower / 1000) % 10;
                        mainInstPowerText[2]=digit1000 + '0';
                    }
                    if (minPower < 100) {
                        mainInstPowerText[3]=' ';
                    } else {
                        uint8_t digit100 = (minPower / 100) % 10;
                        mainInstPowerText[3]=digit100 + '0';
                    }
                    if (minPower < 10) {
                        mainInstPowerText[4]=' ';
                    } else {
                        uint8_t digit10 = (minPower / 10) % 10;
                        mainInstPowerText[4]=digit10  + '0';
                    }
                    {
                        uint8_t digit1 = (minPower / 1) % 10;
                        mainInstPowerText[5]=digit1 + '0';
                    }
                    mainInstPowerText[6]=';';

                    if (maxPower < 1000) {
                        mainInstPowerText[7]=' ';
                    } else {
                        uint8_t digit1000 = (maxPower / 1000) % 10;
                        mainInstPowerText[7]=digit1000 + '0';
                    }
                    if (maxPower < 100) {
                        mainInstPowerText[8]=' ';
                    } else {
                        uint8_t digit100 = (maxPower / 100) % 10;
                        mainInstPowerText[8]=digit100 + '0';
                    }
                    if (maxPower < 10) {
                        mainInstPowerText[9]=' ';
                    } else {
                        uint8_t digit10 = (maxPower / 10) % 10;
                        mainInstPowerText[9]=digit10  + '0';
                    }
                    {
                        uint8_t digit1 = (maxPower / 1) % 10;
                        mainInstPowerText[10]=digit1 + '0';
                    }
                    mainInstPowerText[11]=']';
                    mainInstPowerText[12]='W';
                }
            }
            lcd.drawText(0, currentPencilYPos, mainInstPowerText, 60, 120, get_font58_ptr, Stm32LcdDriver::LCD_Color::Blue, Stm32LcdDriver::LCD_Color::White);
            currentPencilYPos += 120;
        }
        currentPencilYPos -= 15; /* We are not using letters that go below the baseline on font58 (except for the semicolon ';'), so we can afford to go up a bit into that area */
        drawHistory(lcd, 1, currentPencilYPos, lcd.getWidth()-2, lcd.getHeight() - currentPencilYPos - 1, powerHistory, static_cast<void*>(&debugContext));

        debugContext = fullDisplayCycleTimeMs.get();
        /* Counts to 121-157ms depending on the number of columns drawn */
        /* Or without main power display, reduces to 39-75ms */
        /* When using DMA2D (rectangle) to draw solid lines, counts to 118-131ms but a few columns are not drawn properly*/

        {
            Stm32MeasurementTimer displayTimer(true);
            lcd.displayDraft(streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* While waiting, continue forwarding incoming TIC bytes to the unframer */
            //debugContext = displayTimer.get(); /* Counts to 9-10ms */
        }

        {
            Stm32MeasurementTimer fbCopyTimer(true);
            lcd.copyDraftToFinal(); /* 25643 loops without any forced read/write, or 20691 (read+write) loops in the HAL_DMA2D_PollForTransfer() subroutine */
            //debugContext = fbCopyTimer.get(); /* Counts to 16-17ms */
        }

        lcd.requestDisplayFinal(); /* Now we have copied the content to display to final framebuffer, we can perform the switch */

        /* While waiting, continue forwarding incoming TIC bytes to the unframer */
        /* But inject a condition to immediately exit the loop to refresh the display if a new power measurement is received from TIC before the expiration of the wait delay */
        /* The 5s delay should never been reached because TIC data on power comes in more frequently */
#ifndef SIMULATE_POWER_VALUES_WITHOUT_TIC
        waitDelayAndCondition(5000, streamTicRxBytesToUnframer, isNoNewPowerReceivedSinceLastDisplay, static_cast<void*>(&ticContext));
#endif
        {
            unsigned int seconds = ticContext.currentTime.time.toSeconds();
            if (seconds % 10 == 0) {
                if (ticContext.currentTime.relativeToBoot) {
                    Stm32DebugOutput::get().send("Uptime: ");
                }
                else {
                    Stm32DebugOutput::get().send("System time of day: ");
                }
                Stm32DebugOutput::get().send(seconds);
                Stm32DebugOutput::get().send("s\n");
            }
        }
        lcdRefreshCount++;
        if (isNoNewPowerReceivedSinceLastDisplay(static_cast<void*>(&ticContext))) {
            Stm32DebugOutput::get().send("LCD refresh without TIC rx\n");
        }
        else {
            Stm32DebugOutput::get().send("LCD refresh on TIC power rx\n");
        }
    }
}

